FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/БТ_ОпределениеСегментацииКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>БТ_ОпределениеСегментацииКлиентов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СегментацияКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СегментацияКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Принажлежность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_СценарииСегментации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БТ_СценарииСегментации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/БТ_ОпределениеСегментацииКлиентов/Ext/ObjectModule.bsl
Процедура Сформировать() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СегментыКлиентов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СегментыКлиентов КАК СегментыКлиентов
	                      |ГДЕ
	                      |	СегментыКлиентов.БТ_Актуальный
	                      |	И СегментыКлиентов.БТ_СценарийСегментации <> &Пустой
	                      |	И СегментыКлиентов.БТ_СценарийСегментации.Актуальный");	
	
	Запрос.УстановитьПараметр("Пустой", Справочники.БТ_СценарииСегментации.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РассчитатьСегмент(Выборка.Ссылка);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура РассчитатьСегмент(Сегмент)
	
	Если 1 = 2 Тогда
		Сегмент = Справочники.СегментыКлиентов.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = Сегмент.БТ_СценарийСегментации.ТекстЗапроса;
	
	Попытка      
		СписокКонтрагентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Клиент,
		|	СегментацияКлиентовСрезПоследних.СегментКлиента КАК СегментКлиента,
		|	ЕСТЬNULL(СегментацияКлиентовСрезПоследних.Принажлежность, ЛОЖЬ) КАК Принадлежность,
		|	ЕСТЬNULL(СегментацияКлиентовСрезПоследнихТекСегмент.Принажлежность, ЛОЖЬ) КАК ПринадлежностьСегменту
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СегментацияКлиентов.СрезПоследних(, Клиент В (&Ссылка)) КАК СегментацияКлиентовСрезПоследних
		|		ПО (СегментацияКлиентовСрезПоследних.Клиент = Контрагенты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СегментацияКлиентов.СрезПоследних(
		|				,
		|				Клиент В (&Ссылка)
		|					И СегментКлиента = &Сегмент) КАК СегментацияКлиентовСрезПоследнихТекСегмент
		|		ПО (СегментацияКлиентовСрезПоследнихТекСегмент.Клиент = Контрагенты.Ссылка)
		|ГДЕ
		|	Контрагенты.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ПринадлежностьСегменту Тогда
			Продолжить;
		КонецЕсли;	   
		
		Менеджер = РегистрыСведений.СегментацияКлиентов.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Менеджер.СегментКлиента = Сегмент; 
		Об = ВыборкаДетальныеЗаписи.Клиент.ПолучитьОбъект();
		Об.БТ_Сегмент = Сегмент;
		Об.Записать();
		Менеджер.Принажлежность = Истина;
		Менеджер.Записать();
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СегментацияКлиентовСрезПоследних.Клиент КАК Клиент
		|ИЗ
		|	РегистрСведений.СегментацияКлиентов.СрезПоследних(
		|			,
		|			СегментКлиента = &Сегмент
		|				И НЕ Клиент В (&Ссылка)) КАК СегментацияКлиентовСрезПоследних
		|ГДЕ
		|	СегментацияКлиентовСрезПоследних.Принажлежность = ИСТИНА";
	
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	Запрос.УстановитьПараметр("Ссылка", СписокКонтрагентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Менеджер = РегистрыСведений.СегментацияКлиентов.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Менеджер.СегментКлиента = Сегмент;
		Менеджер.Принажлежность = Ложь;
		Менеджер.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
